app/controllers/flashcards_controller.rb

    def show
      # get flashcards from types of the join table
      card = LanguageFlashcard.find_by(id: params[:id])
      cards_with_title = LanguageFlashcard.where(title: card.title)
---
SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."language_id" = $1  [["language_id", 1]]
SELECT "language_flashcards".* FROM "language_flashcards" WHERE "language_flashcards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "language_flashcards".* FROM "language_flashcards" WHERE "language_flashcards"."title" = $1  [["title", "German Freaq"]]