app/controllers/users_controller.rb

    def me
        user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "username", "email", "password_digest", "lang_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"